---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CircuitNumberingOption.Continuous
enum: Autodesk.Revit.DB.Electrical.CircuitNumberingOption
source: html/2f1f8c9e-812f-ac3c-bf3e-3bfd748635b5.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNumberingOption.Continuous

Circuit numbering type is continuous from its parent panel.